[
  {
    "name" : "John",
    "date" : "02/05/2022",
    "profile" : "https://i.ibb.co/nsxYG1M/profile1.jpg",
    "review" : "Ordered combination mouse & keyboard, got the products fast. Recommend Do business with this company."
  },
  {
    "name" : " Luna",
    "date" : "15/04/2022",
    "profile" : "https://i.ibb.co/qNrbbJZ/profile4.jpg",
    "review" : "One of the best Motherboard Processor Combo of AMD ever. Thank you PC Mania ."
  },
  {
    "name" : " Steven",
    "date" : "20/05/2022",
    "profile" : "https://i.ibb.co/34h3VB6/profile3.jpg",
    "review" : "Overall, The mouse is phenomenal. Build quality is stellar, it is super light, and incredibly comfortable to use.I love this mouse. My hands measure at 17x9.5 and i can comfortably relaxed claw it with absolutely no fatigue. The paracord is the most flexible i have seen in a stock cable, and every button and click feels wonderful.If you are into wide mice and play FPS this may be your mouse. If you play other games and am interested in this mouse, get it, it will NOT disappoint. The build quality is incredible."
  },
  {
    "name" : "Ellie",
    "date" : "24/05/2022",
    "profile" : "https://i.ibb.co/1KJ3rW1/profile5.jpg",
    "review" : "Order parts one wasn't in stock they shipped three boxes. One part didn't fit.to contact to get RMA # witch never came i had to chase down the number. They were to send mailing label which never came i had to call to get label. When credit card came there were three charges on bill. I chatted to get a invoice for each that didn't happen. They were mixed together on one invoice still confused and money not right"
  },
  {
    "name" : "Amelia",
    "date" : "17/05/2022",
    "profile" : "https://i.ibb.co/ypnsTtv/profile6.jpg",
    "review" : "Its one of the best Mid range psu. i think this psu  focused on performance and usability on this specific model. packaging was well enough tho you can notice antec cut out some bucks to make this affordable. this semi modular functionality is as good as a fully modular one ( only the 24pin ATX and 8 pic CPU are not removable ) . good for builds with small space."
  },
  {
    "name" : "William",
    "date" : "16/05/2022",
    "profile" : "https://i.ibb.co/hKqGsXP/profile2.jpg",
    "review" : "Great product. It's a Tier 3 quality lineup. Great for running mid - high range rigs. Voltage stability & operating temperature is fantastic. Price is reasonable. It's the best Semi Modular power supply unit compared to price point. Thumbs Up :)."
  }
]